[blog] modify
